In [2]:
import pandas as pd
import numpy as np
import seaborn as sn
import datetime

In [6]:
# Reading the csv file
data=pd.read_csv('train.csv')

In [7]:
data.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
1,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,13 km/kg,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
2,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,3.50

In [8]:
data.isnull().sum()

Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [9]:
df_org=pd.DataFrame(data)

In [10]:
df_cleaned=df_org.dropna(subset=['Mileage','Engine','Power','Seats','New_Price'])

In [11]:
df_cleaned.reset_index(drop=True,inplace=True)

In [12]:
print("original Dataframe shape:",df_org.shape)

original Dataframe shape: (5847, 14)

In [13]:
print("Dataframe",df_cleaned.shape)

Dataframe (814, 14)

In [14]:
# question b

In [55]:
df_cleaned.to_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\new_cleaned_data.csv',index=False)

In [56]:
data_clean=pd.read_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\new_cleaned_data.csv')

In [22]:
data_clean.isnull().sum()

Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

In [57]:
df_unit=pd.read_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\new_cleaned_data.csv')

In [24]:
df_unit['Mileage']=df_unit['Mileage'].str.replace(r' kmpl| km/kg','',regex=True).astype(float)
df_unit['Engine']=df_unit['Engine'].str.replace(' CC','').astype(int)
df_unit['Power']=df_unit['Power'].str.replace(' bhp','').astype(float)
df_unit['New_Price']=df_unit['New_Price'].str.replace(r' Lakh| Cr','',regex=True).astype(float)

In [58]:
data_with_no_units=df_unit.to_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\no_units_data.csv',index=False)

In [59]:
datanounits=pd.read_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\no_units_data.csv')

In [29]:
datanounits.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,13.00,1199,88.70,5.0,8.61,4.50
1,7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,Automatic,First,11.36,2755,171.50,8.0,21.00,17.50
2,10,Maruti Ciaz Zeta,Kochi,2018,25692,Petrol,Manual,First,21.56,1462,103.25,5.0,10.65,9.95
3,15,Mitsubishi Pajero Sport 4X4,Delhi,2014,110000,Diesel,Manual,First,13.50,2477,175.56,7.0,32.01,15.00
4,20,BMW 3 Series 320d,Kochi,2014,32982,Diesel,Automatic,First,22.69,1995,190.00,5.0,47.87,18.55

In [30]:
# Qusetion c

In [60]:
df_encode=pd.read_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\no_units_data.csv')

In [32]:
df_encode=pd.get_dummies(df_encode, columns=['Fuel_Type','Transmission'])

In [61]:
data_encodings=df_encode.to_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\encoding_data.csv',index=False)

In [62]:
data_with_encode=pd.read_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\encoding_data.csv')

In [35]:
data_with_encode.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Fuel_Type_Diesel,Fuel_Type_Petrol,Transmission_Automatic,Transmission_Manual
0,2,Honda Jazz V,Chennai,2011,46000,First,13.00,1199,88.70,5.0,8.61,4.50,0,1,0,1
1,7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,First,11.36,2755,171.50,8.0,21.00,17.50,1,0,1,0
2,10,Maruti Ciaz Zeta,Kochi,2018,25692,First,21.56,1462,103.25,5.0,10.65,9.95,0,1,0,1
3,15,Mitsubishi Pajero Sport 4X4,Delhi,2014,110000,First,13.50,2477,175.56,7.0,32.01,15.00,1,0,0,1
4,20,BMW 3 Series 320d,Kochi,2014,32982,First,22.69,1995,190.00,5.0,47.87,18.55,1,0,1,0

In [36]:
# Question d

In [47]:
data_age=pd.read_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\new_cleaned_data.csv')

In [48]:
df_age=pd.DataFrame(data_age)

In [50]:
current_year=datetime.datetime.now().year

In [51]:
df_age['Car_age']=current_year-df_age['Year']

In [63]:
data_current_age=df_age.to_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\currentage_data.csv',index=False)

In [64]:
data_current_age=pd.read_csv('C:\\Users\\nekka\\OneDrive\\Desktop\\PDS ASSIGNMENT 2\\cleandata\\currentage_data.csv')

In [54]:
data_current_age.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Car_age
0,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,13 km/kg,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50,12
1,7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,Automatic,First,11.36 kmpl,2755 CC,171.5 bhp,8.0,21 Lakh,17.50,7
2,10,Maruti Ciaz Zeta,Kochi,2018,25692,Petrol,Manual,First,21.56 kmpl,1462 CC,103.25 bhp,5.0,10.65 Lakh,9.95,5
3,15,Mitsubishi Pajero Sport 4X4,Delhi,2014,110000,Diesel,Manual,First,13.5 kmpl,2477 CC,175.56 bhp,7.0,32.01 Lakh,15.00,9
4,20,BMW 3 Series 320d,Kochi,2014,32982,Diesel,Automatic,First,22.69 kmpl,1995 CC,190 bhp,5.0,47.87 Lakh,18.55,9